Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/01_create_user/01_create_user.po
Languages: de

source: Create User
de: Benutzer anlegen

source: Before you can start using CODEX you have to create a new user account for your personal work.
de: Bevor Sie mit der Arbeit in CODEX beginnen können, benötigen Sie ein neues persönliches Benutzerkonto.

source: An user account can be created by each indiviual by providing a company or institution email address. The responsible organization admin has to approve this new account before the user can log in again and start working on research projects.
de: Ein neues Benutzerkonto kann von jedem mit einer Firmen- oder Einrichtungs-E-Mail-Adresse erstellt werden. Der Verantwortliche Organisations-Administrator muss das erstellte Benutzerkonto dann freigeben bevor der Benutzer sich anmelden und mit der Arbeit an Forschungsprojekten beginnen kann.

source: The domain of your email address (part after the @-symbol) has to be listed in one of the organizations in the portal. If this is not the case, you will receive an according error message upon registration. In such cases, please contact the portal support.
de: Die Domain Ihrer E-Mail-Adresse (der Teil nach dem @-Symbol) muss in einer der Organisationen im Portal zugelassen sein. Andernfalls erhalten Sie eine entsprechende Fehlermeldung während der Registrierung. In solchen Fällen kontaktieren Sie bitte den Portal-Support.

source: Sign up a new user account
de: Registrierung eines neuen Benutzerkontos

source: To create a new user account navigate to the sign up page which you can find by clicking "SIGN IN" at the main naviation. You will be asked to accept storing cookies on your machine. Accept and this will lead you to the "Login-Page". Hit "Register" below the login form to start a new account registration.
de: Navigieren Sie zur Registrierungsseite, um ein neues Benutzerkonto zu erstellen, welches Sie durch Klicken auf "Anmelden" in der Hauptnavigation aufrufen können. Sie werden zuvor um Erlaubnis gefragt, ob die App Cookies auf Ihrem Gerät speichern darf. Wenn Sie dies erlauben, wird die Anmeldeseite angezeigt. Um einen neuen Registrierungsvorgang zu starten, klicken Sie auf "Registrieren".

source: Login page with a red arrow pointing to the registration link
de: Anmelde-Seite mit rotem Pfeil, der auf den Registrierungslink zeigt

source: Fig 01-01: Position of the register link on Login page
de: Abb 01-01: Position des Registrierungsslinks auf der Anmeldungsseite

source: At the Signup page you will see a form to enter your basic data. All input fields marked with an asterisk are required to proceed.
de: Auf der Registrierungsseite finden Sie ein Formular zur Abfrage ihrer persönlichen Basisdaten vor. Alle mit einem Sternchen markierten Felder kennzeichnen Pflichtangaben.

source: Sign up page with an empty form for first name, last name, email address, password, password confirm, role, department and additional infos and a checkbox for accepting terms and conditions
de: Registrierungsseite mit leerem Formular für Vorname, Nachname, E-Mail-Adresse, Passwort, Passwort-Bestätigung, Role, Abteilung und Sonstige Informatonen und einer Checkbox, um die AGB zu bestätigen

source: Fig 01-02: An emtpy Sign up form on initial page visit
de: Abb. 01-02: Leeres Registrierungsformular bei erstem Seitenaufruf

source: Additionally you have to aggree with the terms and conditions. If you want to read the terms and conditions you can click the link which opens an overlay with the current version of our terms and conditions that you also can directly accept or decline.
de: Zusätzlich müssen Sie den Nutzungsbedingungen zustimmen. Wenn Sie die Nutzungsbedingungen lesen möchten, können Sie durch Klick auf den Link ein Overlay öffnen, welches einerseits die aktuelle Fassung der Nutzungsbedingunen enthält und außerdem zwei Schaltflächen zum Zustimmen oder Ablehnen der Bedingungen anbietet.

source: Fig 01-03: Open Terms and Conditions overlay modal
de: Abb. 01-03: Geöffnetes Overlay mit Nutzungsbedingungen

source: Once you have filled out all information about your person and your login information an email will be sent to your provided email address. If the email has been sent to your inbox you will see the following screen:
de: Nachdem Sie alle benötigten Informationen über ihre Person und Ihre Anmeldeinformationen angegeben haben, erhalten Sie eine E-Mail an die hinterlegte E-Mail-Adresse. Nachdem die E-Mail erfolgreich versandt wurde, sehen Sie folgende Seite:

source: After sign up page which informs about a sent email the user should check.
de: Informationsseite nach der Registrierung, die dem Benutzer mitteilt, dass er eine E-Mail erhalten hat.

source: Fig 01-04: Hint on sent email to confirm registration
de: Abb. 01-04: Hinweis auf eine versendete Bestätigungs-E-Mail

source: In the next step click the activation link in the email, that has been sent to you within 5 minutes to activate your account. If you do not get the email or manage to click the link within 5 minutes, you can always resend the email via the page shown above by clicking on the respective link. If you already closed the page, you can log into the portal with the credentials you provided in the registration process (email and password) to see the page again.
de: Im nächsten Schritt klicken Sie innerhalb von 5 Minuten auf den Aktivierungs-Link in der E-Mail, die Sie erhalten haben. Wenn Sie die E-Mail nicht erhalten oder den Link nicht rechtzeitig anklicken, können Sie die E-Mail über die oben dargestellte Seite erneut senden lassen. Falls Sie die Seite bereits geschlossen haben, können Sie sich mit den bei der Registrierung angegebenen Zugangsdaten (E-Mail, Passwort) in das Portal einloggen, um die Seite erneut angezeigt zu bekommen.

source: After your successful registration you can only see the portals welcome page until your account gets approved. The organization administrator responsible for you is automatically informed via email about your registration. However, the approval is a manual process due to security reasons and therefore can take some time. If you want to see how to approve user accounts go to the section [User management -> Unapproved users](../07_user_management/01_unapproved_users/01_unapproved_users.md)
de: Nach erfolgreicher Registrierung können Sie zunächst nur auf die Startseite des Portals zugreifen bis Sie freigeschaltet wurden. Der für Sie zuständige Organisationsadministrator wird automatisch per E-Mail über Ihre Registrierung informiert. Da der Freischaltungsprozess aus Sicherheitsgründen manuell durchgeführt wird, kann dies einige Stunden in Anspruch nehmen. Wenn Sie erfahren möchten, wie Benutzer freigeschaltet werden, gehen Sie bitte zu Abschnitt [Benutzerverwaltung -> Nicht freigeschaltete Benutzer](../07_user_management/01_unapproved_users/01_unapproved_users.md)
