Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/07_user_management/01_unapproved_users/01_unapproved_users.po
Languages: de

source: Unapproved users management
de: Verwaltung neuer Benutzer

source: This section covers the management of unapproved users. Unapproved users have just registered at the NUM RDP app and wait for approval and assignment of a role.
de: Dieser Abschnitt behandelt die Verwaltung neuer Benutzer. Neue Benutzer haben sich im RDP-Portal registriert und warten auf ihre Freischaltung und die Zuweisung einer oder mehrer Rollen.

source: The following steps can only be executed by users with the role of **Organization Admin** or **Super Admin**.
de: Die folgenden Tätigkeiten können ausschließlich von Benutzern mit der Rolle **Organisations-Admin** oder **Super-Admin** ausgeführt werden.

source: The user management page *New Users* features a list of users that have registered with platform but have not yet been approved. Before new users can use features of the portal, they have to be approved by assigning at least one role to the user.
de: Die Seite *Neue Benutzer* der Benutzerverwaltung stellt eine Liste der Benutzer zur Verfügung, die sich in der Plattform registriert haben, aber noch nicht freigeschaltet wurden. Bevor Benutzer die Portalfunktionen verwenden können, müssen sie freigeschaltet werden, indem mindestens eine Rolle zugewiesen wird.

source: Organization Admins are automatically notified via email, whenever a new user has registered for their organization. This email contains additional information about the user as well as the desired roles.
de: Organisations-Administratoren werden automatisch per E-Mail informiert, sobald sich ein neuer Benutzer für die Organisation registriert hat. Diese E-Mail enthält zusätzliche Informationen zum Benutzer sowie die gewünschten Rollen.

source: Screenshot of new users
de: Bildschirmfoto des Abschnitts Neue Benutzer

source: Fig 07-01-01: New users
de: Abb 07-01-01: Neue Benutzer

source: Approve new users
de: Freischalten neuer Benutzer

source: To approve a user, click on the *pencil* symbol at the beginning of the row to open up a separate dialog. At the top of the dialog the users details as well as the assigned organization are displayed. Below you find a list of roles that you can assign. Do so by clicking the *plus* symbol at the end of the roles row. It changes into a *tick* symbol. You can assign as many roles as you like. You can revert the selection by clicking again on the *tick* symbol.
de: Klicken Sie auf das *Bleistift*-Symbol am Beginn der Zeile des Benutzers, den Sie freischalten wollen, um ein neues Fenster zu öffnen. Im oberen Teil des Dialogfenster werden die Benutzerdetails sowie die zugeordnete Organisation angezeigt. Im unteren Teil finden Sie eine Liste der Rollen, die Sie zuweisen können. Klicken Sie auf das *Plus*-Symbol am Ende einer Zeile, um die Rolle auszuwählen. Das Symbol ändert sich in ein *Häkchen*. Klicken Sie erneut auf das *Häkchen*, um die Rolle wieder abzuwählen. Sie können beliebig viele Rollen gleichzeitig auswählen.

source: Super Admins can assign a wider set of roles than Organization Admins.
de: Super-Administratoren können mehr Rollen zuweisen als Organisations-Administratoren.

source: Screenshot of user approval dialog
de: Bildschirmfoto des Dialogfensters zur Freischaltung neuer Benutzer

source: Fig 07-01-02: User approval dialog
de: Abb 07-01-02: Dialogfenster Freischaltung

source: To assign the roles, click the *save* button. This approves the user and assigns the selected roles. The user is informed via email about the approval and the assigned roles.
de: Klicken Sie auf die Schaltfläche *Speichern*, um die ausgewählten Rollen zuzuweisen. Der Benutzer wird über die Freischaltung und die zugewiesenen Rollen per E-Mail informiert.

source: Users with the **Super Admin** role can also change the organization of the user. The organization is assigned automatically by the domain of the users email address. Please do not change the organization unless you know exactly what you are doing.
de: Benutzer mit der Rolle **Super-Administrator** können die zugewiesene Organisation des Benutzers verändern. Die Organisation wird automatisch anhand der Domain der E-Mail-Adresse des Benutzers zugewiesen. Sofern Sie unsicher sind, ändern Sie bitte keinesfalls die Organisation des Benutzers.
