Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/07_user_management/03_available_roles/03_available_roles.po
Languages: de

source: Available roles
de: Verfügbare Rollen

source: This section provides an overview of the roles that can be assigned and an indicator, if these are exclusive to the *Super Admin*.
de: Dieser Abschnitt stellt eine Übersicht über die Rollen zur Verfügung welche im Portal zugewiesen werden können. Rollen, die nur durch den *Super-Admin* vergeben werden können, sind entsprechend markiert.

source: Role
de: Rolle

source: Permissions
de: Berechtigungen

source: Super Admin only
de: Nur Super-Admin

source: Researcher
de: Forscher

source: Researchers retrieve research data from their assigned projects once the projects are approved and launched. Researchers have no influence on the project description, project application and cohort definition.
de: Die Forscher rufen die Forschungsdaten aus den ihnen zugeordneten Projekten ab, sobald diese bewilligt und gestartet wurden.Forscher haben keinen Einfluss auf die Projektbeschreibung, den Projektantrag und die Kohortendefinition.

source: No
de: Nein

source: Project Lead
de: Projektleiter

source: The project lead creates new projects, describes them, and manages them through the application process to project completion. He is responsible for defining the cohort and manages the researchers assigned to the project.
de: Der Projektleiter legt neue Projekte an, beschreibt diese und verwaltet sie über den Antrag bis zum Projektabschluss.Er verantwortet die Definition der Kohorte und verwaltet die dem Projekt zugeordneten Forscher.

source: Project Approver
de: Projektprüfer

source: <div>Project approvers have an overview of all projects in their own organization.&nbsp;</div><div>They can accept, revise or reject project proposals.</div>
de: Die Projektprüfer haben die Übersicht über alle Projekte der eigenen Organisation.Sie können Projektanträge annehmen, überarbeiten oder ablehnen.

source: Yes
de: Ja

source: Organization Admin
de: Organisations-Admin

source: <div>The organization admins can manage their own organization and its users.</div><div>They approve new users, assign roles and can customize the organization's email domain.</div>
de: Die Organisations-Admins können die eigene Organisation und deren Benutzer verwalten.Sie geben neue Benutzer frei, vergeben Rollen und können die E-Mail Domain der Organisation anpassen.

source: Content Editor
de: Inhalts-Editor

source: The content editors can edit the information tiles on the welcome page.
de: Die Inhalts-Editoren können die Informations-Kacheln auf der Willkommensseite bearbeiten.

source: Criteria Editor
de: Kriterien-Editor

source: The criteria editors manage the criteria within the projects that are unlocked for them. You customize criteria categories and create and modify General Specifications and AQL queries using the Criteria Editor.
de: Die Kriterien-Editoren verwalten innerhalb der für sie freigeschalteten Projekte die Kriterien.Sie passen Kriterien-Kategorien an und erstellen und ändern Allgemeine Angaben und AQL-Queries mit dem Kriterien-Editor.

source: Managers have access to data and patient search and analysis tools and can determine accurate patient counts.
de: Die Manager haben Zugriff auf Daten- und Patientensuch- und Auswertungs-Tools und können exakte Patientenzahlen ermitteln.

source: <div>The super admins have permissions to manage all users and organizations.</div>
de: Die Super Admins haben Berechtigungen um alle Benutzer und Organisationen zu verwalten.
