Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/03_search/01_patient_filter/01_patient_filter.po
Languages: de

source: Patient Filter
de: Patienten-Filter

source: This section covers the Patient filter feature of the Search module.
de: Dieser Abschnitt behandlet den Patienten-Filter der Such-Funktion.

source: With the patient filter you define the desired cohort by selecting and combining criteria. The available criteria are categorized thematically and can be combined as desired using logical operators: AND, OR and NOT.
de: Über den Patienten-Filter kann durch Kombination von Kriterien die gewünschte Kohorte definiert werden. Die verfügbaren Kriterien sind thematisch kategorisiert und können je nach Anforderung kombiniert werden.Dabei können die logischen Operatoren UND, ODER und NICHT verwendet werden.

source: Once you have defined your cohort, you can go to the [Data filter](../02_data_filter/02_data_filter.md) step by clicking on *Next Step* button above the footer of the page.
de: Sobald die Kohorte definiert wurde, können Sie zur Seite [Datenfilter](../02_data_filter/02_data_filter.md) wechseln, indem Sie am unteren Rand der Seite auf die Schaltfläche *Nächster Schritt* klicken.

source: There are three main areas in the patient filter:
de: Im Patienten-Filter gibt es drei wesentliche Bereiche:

source: The criteria list: a list of categorized criteria used to build a cohort
de: Die Kriterien-Liste: Eine Auflistung kategorisierte Kriterien zum Erstellen einer Kohorte

source: The cohort builder: criteria can be combined here using logical operators to build the cohort
de: Der Kohorten-Editor: Kriterien können hier mittels logischer Operatoren kombiniert werden

source: The patients display: display of the expected number of patients in the data sets based on the combined criteria
de: Die Patienten-Anzeige: Anzeige der ermittelten Anzahl von Patienten-Datensätze basierend auf der Kriterien-Kombination

source: Screenshot of patient filter
de: Bildschirmfoto des Patienten-Filters

source: Fig 03-01-01: Patient filter
de: Abb 03-01-01: Patienten-Filter

source: 1. Criteria list
de: 1. Kriterien-Liste

source: The various criteria are divided into categories, these can be expanded and collapsed. Detailed information on each individual criterion can be obtained by clicking on the *i* symbol.
de: Die vielfältigen Kriterien sind in Kategorien unterteilt, die aus- eingeklappt werden können. Detaillierte Informationen zu jedem Kriterium können über einen Klick auf das *i*-Symbol aufgerufen werden.

source: To use a criterion and add it to the cohort builder, click it's plus icon. The criterion is then inserted directly into the cohort builder in the active (red bordered) group.
de: Um ein Kriterium zu verwenden und zum Kohorten-Editor hinzuzufügen, klicken Sie auf das Plus-Symbol. Das Kriterium wird direkt in die aktive (rot umrandete) Gruppe im Kohorten-Editor übernommen.

source: Screenshot of patient filter criteria list
de: Bildschirmfoto der Kriterien-Liste im Patienten-Filter

source: Fig 03-01-02: Criteria list
de: Abb 03-01-02: Kriterien-Liste

source: After clicking on the *i* symbol of a criterion, a dialog window opens, from which you can find more detailed information about the criterion. The top section provides information about the title, author, purpose, and how the criterion is used. In the lower area you can see how the actual aql query is written in the Archetype Query Language (AQL).
de: Nach Anklicken des *i*-Symbols eines Kriteriums öffnet sich ein Dialog-Fenster, welches detaillierte Informationen zu dem Kriterium enthält. Der obere Abschnitt enthält Informationen über Titel, Autor, Zweck und Verwendung des Kriteriums. Der untere Abschnitt enthält die verwendete Abfrage in der Archetype Query Language (AQL).

source: Screenshot of criteria details dialog
de: Bildschirmfoto des Dialogfensters mit Kriterien-Details

source: Fig 03-01-03: Criteria detail view
de: Abb 03-01-03: Kriterien-Detail-Ansicht

source: 2. Cohort builder
de: 2. Kohorten-Editor

source: In the cohort builder, the criteria are inserted in the order you selected/clicked them from the list.
de: Im Kohorten-Editor werden Kriterien in der Reihenfolge angeordnet, in der Sie sie aus der Liste auswählen/anklicken.

source: You have the following options for forming a cohort:
de: Zum Erstellen einer Kohorte stehen Ihnen die folgenden Möglichkeiten zur Verfügung:

source: Groupings: by default, a main group is created in the cohort builder, you can either insert criteria directly (loosely) into this or create subgroups. In order for a criterion to be inserted into a group, it must be activated. To do this, you need to select the tick in the top left corner of the group. A selected group is marked with a red border; the unselected groups are outlined in light gray. You can also delete groups, but it should be noted that the criteria contained in them will then also be removed.
de: Gruppierung: standardmäßig werden alle Kriterien in die angelegte Hauptgruppe eingefügt und (lose) miteinander verknüpft. Wenn Sie bestimmte Kriterien stärker miteinander verknüpfen wollen, können Sie Untergruppen dafür anlegen. Um ein Kriterium in einer angelegten Untergruppe hinzuzufügen, muss die Gruppe ausgewählt werden. Klicken Sie dazu auf das graue Häkchen am linken Rand der Gruppen-Umrandung. Die ausgewählte Gruppe wird durch einen roten Rand gekennzeichnet, während nicht ausgewählte Gruppen mit einem grauen Rand dargestellt werden. Untergruppen können jederzeit gelöscht werden - dabei ist zu beachten, dass die in der Untergruppe enthaltenen Kriterien dabei ebenfalls entfernt werden.

source: Operators: you can set conditions using "AND" and "OR" operators. Operators can be applied directly to groups and within groups/subgroups to the criteria. "AND" is set by default as soon as two and more criteria or groups of criteria have been inserted in the cohort builder.
de: Operatoren: Sie können Bedingungen definieren mittels der UND- und ODER-Operatoren. Operatoren können direkt auf die Hauptgruppe oder Untergruppen angewendet werden sowie auf die Kriterien innerhalb der Gruppen. Standardmäßig wird UND verwendet, sobald zwei oder mehr Kriterien oder Gruppen im Kriterien-Editor eingefügt wurden.

source: Negation: using the negate button, the conditions of criteria can be negated within a group or between entire groups.
de: Negation: Mittels des Negation-Schalters in der rechten oberen Ecke einer Gruppe können die Bedingungen in einer Gruppe oder die Beziehungen zwischen Gruppen negiert werden.

source: Screenshot of criteria in a main group
de: Bildschirmfoto von Kriterien in der Hauptgruppe

source: Fig 03-01-04: Cohort builder with criteria in a main group
de: Abb 03-02-04: Kohorten-Editor mit Kriterien in der Hauptgruppe

source: Screenshot of criteria in two subgroups
de: Bildschirmfoto von Kriterien in zwei Untergruppen

source: Fig 03-01-05: Cohort builder with criteria in two subgroups
de: Abb 03-01-05: Kohorten-Editor mit Kriterien in zwei Untergruppen

source: Structure of the criterion elements
de: Struktur der Kriterien-Elemente

source: The criterion elements can differ in structure, scope and the type of information required.
de: Die Kriterien-Elemente unterscheiden sich je nach Struktur, Ausrichtung und der Art der erforderlichen Informationen.

source: Green: all parameters have been filled in
de: Grün: Alle Parameter wurden ausgefüllt

source: Grey: some parameters need to be filled in
de: Grau: Einige Parameter müssen noch ausgefüllt werden

source: Name of the parameter
de: Name des Parameters

source: Operator for the current parameter value
de: Operator für den Parameter-Wert

source: Parameter value, there are three field types for the parameter value:
de: Parameter-Wert, es gibt drei Feldtypen für den Wert:

source: Free text input field: the necessary unit of the value can be in the field name.
de: Freitext Eingabefeld: der abzufragende Wert wird direkt eingetragen

source: Dropdown list with predefined values
de: Auswahlliste mit vordefinierten Werten

source: Date field with calendar datepicker
de: Datumsfeld mit Kalender-Auswahl

source: Check box:
de: Kontrollkästchen:

source: Selected: a parameter value must be entered/selected so that the criterion for the cohort is defined.
de: Ausgewählt: Es muss ein Wert für den Parameter des Kriteriums eingetragen werden.

source: Deselected: no parameter value can be entered/selected. As a result, all data sets in which information was provided on the respective criteria are included in the cohort - regardless of the value.
de: Nicht ausgewählt: Es muss kein Wert für den Parameter eingetragen/ausgewählt werden. Im Ergebnis werden alle Datensätze berücksichtigt, die für das entsprechende Kriterium einen Wert hinterlegt haben, unabhängig vom tatsächlichen Wert.

source: Screenshot of criteria elements
de: Bildschirmfoto der Kriterien-Elemente

source: Fig 03-01-06: Cohort builder with criteria elements
de: Abb 03-01-06: Kohorten-Editor mit Kriterien-Elementen

source: There are also criteria that do not require the entry of parameters, these can be used directly.
de: Einige Kriterien erfordern keine Eingabe von Parameter. Diese können direkt ohne weitere Bearbeitung verwendet werden.

source: This area shows the number of patients in the entire dataset resulting from the configuration of the cohort. To retrieve the patients, you must click the *Retrieve* button. The number of patients is then displayed. Depending on the authorization and if the data is available, the patients are also displayed in a graphical representation.
de: Dieser Bereich zeigt die ermittelte Anzahl der Patienten auf Basis der definierten Kohorte an. Um die Anzahl anzeigen zu lassen, klicken Sie auf die *Ermitteln*-Schaltfläche. Je nach Berechtigung wird unterhalb des Bereiches zusätzlich eine grafische Aufbereitung der ermittelten Zahlen dargestellt.

source: If you make changes to the cohort in the cohort builder, you need to press "Retrieve" each time for an accurate patients count.
de: Wenn Sie an der Kohorte Änderungen vornehmen, müssen Sie erneut *Ermitteln* anklicken, um die aktuelle Patientenanzahl angezeigt zu bekommen.

source: Due to data privacy reasons, only users inheriting the "Manager" role are able to see the exact number of patients. Users without this role will always see a slightly rounded number.
de: Aus Datenschutzgründen wird nur Benutzer mit der Rolle "Manager" die exakte Patientenzahl angezeigt. Allen anderen Benutzern wird ein geringfügig gerundeter Wert angezeigt.

source: Screenshot of cohort hits and diagrams
de: Bildschirmfoto der Kohortentreffer und Diagramme

source: Fig 03-01-07: Cohort builder data hits and data diagrams
de: Abb 03-01-07: Kohorten-Editor Patientenzahl und Diagramme
