Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/03_search/02_data_filter/02_data_filter.po
Languages: de

source: Data filter
de: Datenfilter

source: This section covers the data filter page of the search module.
de: Dieser Abschnitt behandelt den Datenfilter der Such-Funktion.

source: You get to the data filter if you created the {term}`cohort` in the [Patient filter](../01_patient_filter/01_patient_filter.md) in the previous step and clicked on *Next step* button. With the data filter you can now filter the defined cohort according to specific return parameters based on the GECCO data set.
de: Sie erreichen den Datenfilter indem Sie eine {term}`Kohorte` im [Patienten-Filter](../01_patient_filter/01_patient_filter.md) erstellen und anschließend auf die Schaltfläche *Nächster Schritt* klicken. Mittels des Datenfilters können Sie die über die Kohorte ermittelten Daten nun auf spezifische Rückgabeparameter basierend auf dem GECCO-Datensatz eingrenzen.

source: The size of the defined cohort is displayed above the return parameters area. To select the return parameters, click *Add Parameter*. A dialog window will then open in which you can make your selection. Depending on your authorization, you can then either start a data retrieval or transfer the configuration to a project in a further step.
de: Der Umfang der definierten Kohorte wird oberhalb der Rückgabeparameter angezeigt. Klicken Sie auf *Parameter hinzufügen*, um Rückgabeparameter zu auszuwählen. Es öffnet sich ein Dialogfenster, in dem Sie Ihre Auswahl treffen können. Je nach den Ihnen zugeordneten Berechtigungen können Sie anschließend einen Datenabruf starten oder die Konfiguration in ein neues Projekt überführen.

source: Depending on your authorization, you have the following additional options and only see the corresponding button:
de: Basierend auf Ihren Berechtigungen haben Sie die folgenden Optionen:

source: Create project application: this function is only available and visible to project managers.
de: Projektantrag stellen: Diese Funktion ist ausschließlich für Benutzer mit der Rolle "Projektleiter" verfügbar.

source: Start data retrieval: this function is only available and visible to managers.
de: Datenabruf starten: Diese Funktion ist ausschließlich für Benutzer mit der Rolle "Manager" verfügbar.

source: Screenshot of data filter
de: Bildschirmfoto des Datenfilters

source: Fig 03-02-01: Data filter
de: Abb 03-02-01: Datenfilter

source: In order to select {term}`return parameters` press *Add return parameter*. In the dialog you can select the desired return parameter(s) from a list. To do this, click on the respective plus symbol. As soon as a parameter is selected, the symbol changes to a tick. If you click the tick again, the symbol changes back to a plus and the return parameter is no longer selected. Above the list is a search box that you can use to search directly for parameters and narrow the list down accordingly.
de: Klicken Sie auf *Paramter hinzufügen*, um {term}`Rückgabeparameter` auszuwählen. Im Dialogfenster können Sie die gewünschten Rückgabeparameter aus einer mehrseitigen Liste auswählen. Klicken Sie dazu auf das jeweilige Plus-Symbol, welches sich daraufhin in ein Häkchen ändert. Sie können beliebig viele Parameter auswählen. Klicken Sie erneut auf das Häkchen hinter einem Parameter, um diesen wieder abzuwählen. Oberhalb der Liste befindet sich ein Suchfeld, worüber Sie Parameter direkt suchen können.

source: As soon as you have selected one or more return parameters, you can add the parameters to the data filter by clicking on *Apply selection* button. The dialog window then closes automatically.
de: Sobald Sie einen oder mehrere Rückgabeparameter ausgewählt haben, können Sie diese hinzufügen, indem Sie die Schaltfläche *Auswahl übernehmen* anklicken. Das Dialogfenster wird automatisch geschlossen und die ausgewählten Parameter nun im Bereich Datenfilter angezeigt.

source: Return parameters are mandatory, in order to continue you must select at least one parameter.
de: Für die weitere Bearbeitung muss mindestens ein Rückgabeparameter ausgewählt werden.

source: Screenshot of data filter return parameters
de: Bildschirmfoto der Rückgabeparameter des Datenfilters

source: Fig 03-02-02: Data filter return parameters
de: Abb 03-02-02: Datenfilter mit Rückgabeparametern

source: After you have selected the return parameters, they are displayed in the data filter list. Now you can calculate the number of patients in the data set within the defined cohort for the respective return parameter. To do this, click on *Determine patients*. Each return parameter listed in the table can be removed from the list by clicking on the trash can icon. You can also add further return parameters to the list by clicking on *Add return parameter* button.
de: Sie können nun für jeden Rückgabeparameter die Anzahl der Patienten im Datensatz der Kohorte separat ermitteln lassen. Klicken Sie dazu auf *Patienten ermitteln*. Jeder Rückgabeparameter kann durch Klick auf das Mülltonnensymbol wieder aus der Liste entfernt werden. Ebenso können jederzeit weiter Parameter hinzugefügt werden.

source: Screenshot of data filter determine patients
de: Bildschirmfoto des Datenfilters mit ermittelten Patientenzahlen

source: Fig 03-02-03: patients per return parameter
de: Abb 03-02-03: Patienten pro Rückgabeparameter

source: With the return parameters now defined, depending on your role and/or permission in your organization, you can proceed as follows:
de: Nach Auswahl der Rückgabeparameter können Sie nun je nach den Ihnen zugeordneten Berechtigungen wie folgt weiter verfahren:

source: Create project application: With the role "Project manager" you can now apply all settings that you have made in the patient and data filter directly to a new project. This configuration can also be adjusted in the project itself.
de: Projektantrag stellen: Mit der Rolle "Projektleiter" können Sie nun die Kohorte und die getroffenen Einstellungen in ein neues Projekt überführen. Die Konfiguration kann im Rahmen des Projektantrags noch weiter angepasst werden.

source: Start data retrieval: With the role "Manager" you can start a data retrieval based on the settings in the patient and data filter.
de: Datenabruf staren: Mit der Rolle "Manager" können Sie einen Datenabruf auf Basis der getroffenen Einstellungen starten.

source: Screenshot of data filter next steps
de: Bildschirmfoto der möglichen nächsten Schritte im Datenfilter

source: Fig 03-02-04: Data filter next steps
de: Abb 03-02-04: Nächste Schritte im Datenfilter
