Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/06_criteria/02_criteria_editor/02_criteria_editor.po
Languages: de

source: Criteria - Editor
de: Kriterien-Editor

source: This section covers the editor of the criteria module.
de: Dieser Abschnitt behandelt den Kriterien-Editor.

source: The criteria editor provides functionality to define a criterion, as well as to determine available datasets based on the criterion AQL query. There are two main sections of the criterion definition:
de: Der Kriterien-Editor stellt Funktionen zur Verfügung, um Kriterien anzulegen und zu prüfen, wieviele Datensätze für bestimmte Kriterien-Definitionen verfügbar sind.

source: General information
de: Allgemeine Angaben

source: Build the criterion
de: Kriterium erstellen

source: The general information section contains information about the criterion such as:
de: Der Abschnitt "Allgemeine Angaben" enthält die folgenden Informationen zum Kriterium:

source: No.
de: Nr.

source: Field
de: Feld

source: Mandatory
de: Pflichtfeld

source: English title
de: Englisch: Titel

source: Yes
de: Ja

source: English use
de: Englisch: Verwendung

source: English purpose
de: Englisch: Zweck

source: German title
de: Deutsch: Titel

source: German use
de: Deutsch: Verwendung

source: German purpose
de: Deutsch: Zweck

source: Category
de: Kategorie

source: No
de: Nein

source: Criteria for public use
de: Kriterium zur öffentlichen Verwendung markieren

source: Screenshot of criteria editor general information
de: Bildschirmfoto der Allgemeinen Angaben des Kriterien-Editors

source: Fig 06-02-01: Criteria editor general information
de: Abb 06-02-01: Kriterien-Editor Allgemeine Angaben

source: In this section the actual criterion is being defined, this area is split into 3 areas:
de: In diesem Abschnitt wird das Kriterium definiert. Der Abschnitt unterteilt sich in drei Bereiche.

source: The criterion builder area
de: Erstellung des Kriteriums

source: The criterion raw query area
de: Rohdarstellung der Abfrage

source: The hits area
de: Ermittlung der Patientenzahl

source: Screenshot of criteria editor builder
de: Bildschirmfoto der Kriterien-Erstellung

source: Fig 06-02-02: Criteria editor builder
de: Erstellung des Kriteriums

source: One of two ways for building a criterion. By pressing the build criterion button a dialog will pop up. On the left-hand side of the dialog the return parameters can be selected. After selecting the desired return parameters, the actual data of interest which will make up the criterion needs to be double-clicked in order to be added to the right-hand side of the dialog in the selected query clause.
de: Durch Klick auf die Schaltfläche *Kriterium erstellen* öffnet sich ein Dialog. Auf der linken Seite des Dialogfensters können die Rückgabeparameter ausgewählt werden. Nach Auswahl des Rückgabeparameters müssen die eigentlichen Datenfelder, welche das Kriterium bilden sollen, per Doppelklick in das Abfragefenster auf der linken Seite eingefügt werden.

source: Screenshot of criteria editor dialog
de: Bildschirmfoto des Dialogfensters zur Kriterien-Erstellung

source: Fig 06-02-03: Criteria builder dialog
de: Abb 06-02-03: Dialogfenster Kriterien-Erstellung

source: The right-hand side of the dialog contains the three query clauses supported by the builder:
de: Die rechte Seite des Dialogfensters enthält die drei Bestandteile der Abfrage, die bei der Kriterien-Erstellung unterstützt werden:

source: The **Select** clause represents the exact data needed for the criterion
de: Der Bestandteil **Select** repräsentiert die konkreten Daten, welche das Kriterium verarbeiten soll.

source: The **From** clause's purpose is to scope the data source for the query by specifying a certain subset from the data available; for example narrowing the data to a certain composition
de: Der Bestandteil **From** legt fest, aus welcher Datenquelle die Daten bezogen werden sollen, z.B. nur aus einer festgelegten Composition.

source: The **Where** clause's purpose is to filter the data set within the data in the *From* clause. Logical operators can be applied to combine multiple expressions.
de: Die **Where**-Bedingung bietet die Möglichkeit, den Ergebnisdatensatz zu filtern. Um mehrere Bedingungen zu verknüpfen, können logische Operatoren verwendet werden (AND, OR).

source: The **Select** and **From** clauses are mandatory, the **Where** clause is optional
de: Die Bestandteile **Select** und **From** müssen angegeben werden. Die **Where**-Bedingungen sind optional.

source: By pressing the *Apply Selection* button the raw query is computed and added to the criterion raw query area.
de: Indem Sie auf *Auswahl übernehmen* klicken, wird die Abfrage in das Abfragefenster des Kriteriums übertragen.

source: Contains the raw criterion query. This can be built by using the builder functionality or can be directly typed in. There is also the option to format the typed in query and to validate its correctness.
de: Dieses Fenster enthält die für das Kriterium verwendete Abfrage. Diese kann entweder über die Kriterien-Erstellung angelegt oder direkt von Hand eingegeben werden. Über die Schaltflächen unterhalb des Fenster kann die Abfrage formiert und auf Validität geprüft werden.

source: This area shows the number of patients in the entire dataset resulting from the query. To retrieve the patients, you must click the *Determine* button. The number of patients is then displayed depending on the authorization.
de: Dieser Abschnitt ermöglicht die Ermittlung der Anzahl der Patienten, welche bei Verwendung dieses Kriteriums berücksichtigt werden, basierend auf den in der Datenbank vorhandenen Datensätzen.
