Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/08_organizations/01_organizations_overview/01_organizations_overview.po
Languages: de

source: Organizations - Overview
de: Organisations-Übersicht

source: This section covers the overview page of the organization management feature.
de: Dieser Abschnitt behandelt die Übersicht in der Organisationsverwaltung.

source: Only users with **Super admin** or **Organization admin** roles can access the organization management feature. For **Super admin** users a list with all organizations available will be displayed.
de: Nur Benutzer mit der Rolle **Super-Admin** oder **Organisations-Admin** haben Zugriff auf die Organisationsverwaltung. **Super-Admins** bekommen eine Liste aller angelegten Organisationen angezeigt.

source: Organizations can be created and updated, they cannot be deleted.
de: Organisationen können angelegt und bearbeitet, aber nicht gelöscht werden.

source: Screenshot of organization overiew for super admin
de: Bildschirmfoto der Organisations-Übersicht für den Super-Admin

source: Fig 08-01-01: Organization overiew for Super Admin
de: Abb 08-01-01: Organisations-Übersicht für den Super-Admin

source: For **Organization admin** users, the organization overview page will hold a single row with the admins own organization.
de: Für **Organisations-Admins** wird in der Übersicht ausschließlich die eigene Organisation angezeigt.

source: Screenshot of organization overiew
de: Bildschirmfoto der Organisations-Übersicht

source: Fig 08-01-02: Organization overiew for Organization admin
de: Abb 08-01-02: Organisations-Übersicht für Organisations-Admins

source: Click on the *pencil* symbol at the beginning of the row to access the organizations editor.
de: Klicken Sie auf das *Stift*-Symbol am Beginn einer Zeile, um den Organisations-Editor aufzurufen.
