Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/05_data_explorer/02_data_explorer_data_retrieval/02_data_explorer_data_retrieval.po
Languages: de

source: Data retrieval
de: Datenabruf

source: This section covers the data retrieval page of the data explorer feature.
de: Dieser Abschnitt behandelt den Datenabruf aus Projekten.

source: The data retrieval page is divided into three areas:
de: Der Datenabruf ist in drei Abschnitte unterteilt:

source: Project summary: here you have complete insight into the configuration of the project. All information is read-only. You can expand and collapse the individual areas.
de: Projektzusammenfassung: Vollständige Übersicht der Projekt-Konfiguration. Diese Information kann nur gelesen und nicht verändert werden. Jeder Bereich kann nach Bedarf ein- und ausgeklappt werden.

source: Data retrieval: in this section you can start the complete data retrieval. You also have the option of limiting the data retrieval using filters. Start the entire data retrieval by clicking on *Retrieve data* button.
de: Datenabruf: In diesem Abschnitt kann der Datenabruf ausgeführt werden. Darüber hinaus besteht die Möglichkeit, die Daten vor Abruf weiter einzuschränken bzw. zu filtern. Zum Starten des Datenabrufs klicken Sie auf *Daten abrufen*.

source: Result set: after the data retrieval has been started, the available data sets are displayed in this section.
de: Ergebnissatz: Nachdem der Datenabruf gestartet wurde, werden in diesem Abschnitt die tatsächlichen Daten dargestellt.

source: Screenshot of detailed data retrieval
de: Bildschirmfoto des Datenabrufs

source: Fig 05-02-01: Data retrieval
de: Abb 05-02-01: Datenabruf

source: Result set
de: Ergebnissatz

source: At data retrieval the result set is displayed based on the configurations specified in the project.
de: Bei Abruf der Daten wird der Ergebnissatz gemäß der Projektkonfiguration dargestellt.

source: In the standard configuration, the complete result set is produced as table(s). The output result set is based on the return parameters as defined in the project as a basis.
de: In der Ausgangskonfiguration wird der gesamte Ergebnissatz als Tabelle(n) erzeugt. Der Ergebnissatz basiert auf der Konfiguration der Rückgabeparameter in der Projektdefinition.

source: In addition, you have the option of a user-defined configuration. You can customize the configuration of the data query as part of the defined return parameters. To access this function, click on *Filter data* button. Please note that setting filters can result in unwanted cross products.
de: Zusätzlich besteht die Möglichkeit, den Ergebnissatz individuell zu filtern bzw. weiter einzuschränken. Klicken Sie auf *Daten filtern*, um diese Funktion aufzurufen. Bitte beachten Sie, dass das Setzen eigener Filter zu unerwünschten Kreuzprodukten führen kann.

source: Representation of the result set
de: Darstellung des Ergebnissatzes

source: The result set is presented as a table. A separate table is generated for each return parameter defined in the project.
de: Der Ergebnissatz wird in Tabellenform dargestellt. Für jeden Rückgabeparameter wird eine separate Tabelle erzeugt.

source: The table structure is as follows:
de: Die Tabellen sind wie folgt strukturiert:

source: Rows: the results of the cohort specified in the project, i.e. the patient filter, are displayed in rows. Each available record makes up one row.
de: Zeilen: Die Ergebnisse der im Projekt definierten Kohorte (Patientenfilter), sind in Zeilen dargestellt. Jeder Datensatz wird durch eine Zeile repräsentiert.

source: Columns: the columns represent the data filter and contain all parameters for which information is available in the respective data record.
de: Spalten: Die Spalten repräsentieren die Datenfilter und enthalten alle Parameter, für die Daten im Datensatz verfügbar sind.

source: Screenshot of data retrieval results
de: Bildschirmfoto der Datenabruf-Ergebnisse

source: Fig 05-02-02: Data retrieval results
de: Abb 05-02-02: Ergebnisse des Datenabrufs

source: Export of the result set
de: Exportieren des Ergebnissatzes

source: You can export the entire displayed result as either a CSV file or a JSON file. A separate file is created for each return parameter.
de: Der angezeigte Ergebnissatzes kann vollständig im CSV- oder JSON-Format zur weiteren Verwendung exportiert werden. Für jeden Rückgabeparameter wird eine separate Datei erzeugt.
