Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/02_welcome/02_welcome.po
Languages: de

source: Welcome page
de: Willkommensseite

source: All users will be redirected to the welcome page after a successful login. This page contains some basic statistics about data available for the logged in user, e.g. the projects that have received updates the last time, as well as general information that might be useful for the user and that is managed by {term}`Content Admin`s.
de: Jeder Benutzer wird nach erfolgreichem Login auf die Willkommensseite weitergeleitet. Diese Seite enthält grundlegende Informationen zum Portal sowie einige Statistiken und eine Übersicht über kürzlich aktualisierte Projekte , die für den Benutzer nützlich sein können. Zusätzlich werden Kacheln zu weiterführenden Informationen angezeigt, welche von {term}`Inhalts-Administrator`en verwaltet werden.

source: Introduction / Statistics
de: Einführung / Statistiken

source: The first part includes a general introduction and welcome message to inform the user about the purpose of the platform. If you want to jump to the list of participating clinics you can use the link at the end of the text.
de: Der erste Abschnitt enthält eine generelle Einführung, um den Benutzer über den Zweck der Plattform zu informieren. Um direkt zu den teilnehmenden Kliniken zu springen, kann der Link am Ende des Textes verwendet werden.

source: Screenshot of the welcome page showing the introduction text followed by general statistics
de: Bildschirmfoto des Einführungsabschnitts der Willkommensseite

source: Fig 02-01: Introduction part of the welcome page
de: Abb 02-01: Einführungsabschnitt der Willkommensseite

source: The welcome message is followed by a general statistics that informs about how many projects and {term}`Criteria` haven been added to the running CODEX system and also how many different clinics have provided previously mentioned data.
de: Auf die Einführung folgt eine Statistik der Anzahl der Projekte und {term}`Kriterien`, die zum CODEX-System hinzugefügt wurden sowie die Anzahl der Kliniken, die Daten zur Verfügung gestellt haben.

source: These statistics only contain general data and contain no sensitive information about contents or names of participating clinics.
de: Diese Statistiken enthalten nur allgemeine Informationen und enthalten keinerlei sensible Informationen über die teilnehmenden Kliniken oder die bereitgestellten Daten.

source: Latest projects
de: Neueste Projekte

source: The list of latest {term}`Project`s is only visible for users that have logged in to the application.
de: Die Liste der neuesten {term}`Projekt`e ist nur für Benutzer sichtbar, die sich am Portal angemeldet haben.

source: In the list of latest {term}`Project`s the user can see the last 5 projects the user has access to and that have changed the last time. This can be used to get a quick overview if there are recent changes to a project the user is interested in.
de: In der Liste der neuesten {term}`Projekt`e werden die 5 Projekte angezeigt, an welchen zuletzt Änderungen vorgenommen wurden. Es werden nur Projekte , auf die der angemeldete Benutzer Zugriff hat. Die Liste kann dazu verwendet werden, einen schnellen Überblick über die Änderungen in den laufenden Projekten zu gewinnen.

source: Screenshot of table of latest changed projects including the change date
de: Bildschirmfoto der Tabelle der zuletzt geänderten Projekte inklusive des Änderungsdatums

source: Fig 02-02: Table of latest projects
de: Abb 02-02: Tablle der neuesten Projekte

source: This list provides only readable information. If you want to edit or work with projects go to the page [Projects](../04_projects/04_projects.md) or [Data Explorer](../05_data_explorer/05_data_explorer.md).
de: Die Informationen in dieser Liste können nicht bearbeitet werden. Wenn Sie Projekte bearbeiten oder mit deren Daten arbeiten möchten, wechseln Sie bitte zur Seite [Projekte](../04_projects/04_projects.md) oder [Datenabruf](../05_data_explorer/05_data_explorer.md).

source: The info board content is only visible to users that are successfully logged in.
de: Der Inhalt des Info Boards ist nur für angemeldete Benutzer sichtbar.

source: The Info Board section contains of content provided by {term}`Content Admin` users. This section can contain useful information for users to assist them in their work or to announce information to logged in users.
de: Der Inhalt des Info Boards wird durch Benutzer mit der Rolle {term}`Inhalts-Administrator` bereitgestellt. Dieser Bereich kann hilfreiche Informationen bieten, um angemeldete Benutzer bei der Arbeit im Portal zu unterstützen.

source: Screenshot of the info board with two cards with test and demo content.
de: Bildschirmfoto des Info Boards mit zwei Kacheln

source: Fig 02-03: Info board cards
de: Abb 02-03: Info Board Kacheln

source: Participating clinics
de: Teilnehmende Kliniken

source: In the following section all participating clinics are represented by their corresponding logo.
de: Im folgenden Abschnitt werden alle teilnehmenden Kliniken durch ihr jeweiliges Logo repräsentiert.
