Repository: NUM-Forschungsdatenplattform/num-portal-webapp
Catalog: docs/locales/*/LC_MESSAGES/00_glossary/00_glossary.po
Languages: de

source: Glossary
de: Glossar

source: A special query language inspired by SQL to get data from an {term}`openEHR` like system. Can be used on all {term}`openEHR` systems to get data from stored {term}`EHRs<EHR>`.
de: Eine spezielle von SQL inspirierte Abfragesprache welche zum Abruf von Daten aus einekm {term}`openEHR<openEHR>` System genutzt werden kann. Kann in allen {term}`openEHR<openEHR>` Systemem dazu verwendet Daten von {term}`EHRs<EHR>` abzurufen.

source: Cohort : Cohort
de: Kohorte : Cohort

source: A combination and parametrized selection of {term}`Criteria` to restrict data output to a subset of {term}`EHRs<EHR>`, e.g. "Vaccinated persons over the age of 18" or "All female persons over the age of 60".
de: Eine Kombination und parameterisierte Auswahl von {term}`Kriterien<Criteria>` um die Ausgabedaten bei der Abfrage von {term}`EHRs<EHR>` einzugrenzen, z.B. "Geimpfte personen über 18 Jahre" oder "Alle weiblichen Personen über 60 Jahre".

source: Content Admin : Content Admin
de: Inhalts-Administrator : Content Admin

source: A role of users that is allowed to add, modify and delete content to the Info Board and the Navigation menu section.
de: Eine Benutzerrolle die dem Benutzer erlaubt, Inhalte zum Info-Boards oder der Naviagtion hinzuzufügen, zu ändern oder zu löschen.

source: Criteria : Criteria
de: Kriterien : Criteria

source: A special description in {term}`AQL` sytax that describes a filter criteria to extract a sub set of data.
de: Eine Abfragebeschreibung in {term}`AQL<AQL>` Syntax welche ein Filterkriterium definiert um eine Untermenge von Daten zu extrahieren.

source: Electronic health record. A data record that is connected to a person and collects all treatments and measurements during a specific period of time, e.g. duration of a clinical stay of the person.
de: Electonic health record - Elektronische Patientenakte. Ein einer Person zugeordneter Datensatz welcher alle Anwendungen und Messungen zu einem gegebenen Zeitraum gruppiert, z.B. über die Dauer eines Klinik-Aufenthaltes.

source: Netzwerk Universitätsmedizin. A collaboration of clinics in Germany that work together in several specific medical applications. In case of CODEX the goal is to implement a data exchange platform for researchers on big data sets.
de: Netzwerk Universitätsmedizin. Eine Kollaboration von Kliniken in Deutschland welche die Zusammenarbeit in mehreren speziellen medizinischen Anwendungen zum Ziel hat. Im Fall von CODEX ist das Ziel die Umsetzung einer Forschungsdatenplattform für Forschungprojekte mit verteilten und umfangreichen Datenbeständen.

source: Open international standard to store data together with the semantic information on how data has to be interpreted.
de: Offener, internationaler Standard für die Speicherung von Daten inklusive der sematischen Informationen darüber, wie die Daten zu interpretieren sind.

source: See [openEHR project website](https://www.openehr.org) for more information.
de: Siehe [openEHR Projektwebseite](https://www.openehr.org) für weitere Informationen.

source: Project : Project
de: Projekt : Project

source: A project contains the meta and control data to stear research on a specific topic and subset of data extracted from the data pool.
de: Ein Projekt enthält die Meta- und Kontrolldaten um die Forschung zu einem bestimmten Thema und einer Untermenge an Daten zu steuern.

source: It contains the {term}`Cohort` definition as well as general information like the purpose, hypothesis or period of time the project is intended to run.
de: Es enthält die Definition der {term}`Kohorte<Cohort>` sowie allgemeine Inforamtioen wie den Zweck, Hypothesen als auch den Zeitraum der für die Laufzeit des Projekts vorgesehen ist.

source: For the data retrieval and work on the data all {term}`Return Parameters` are as well defined as the {term}`Researcher` who works with the data.
de: Für den Abruf von und die Arbeit mit den Projektdaten werden im Projekt zusätzlich die {term}`Rückgabeparameter<Return Parameters>` und die {term}`Forscher<Researcher>` definiert welche mit den Daten arbeiten sollen.

source: Researcher : Researcher
de: Forscher : Researcher

source: A natural person that works inside a project on the data and is allowed to retrieve the data. A researcher can only see the data assigned to a project.
de: Eine natürliche Person welche in einem Projekt arbeitet und dazu berechtigt ist Daten im Rahmen des Projekts abzufragen. Ein Forscher kann nur die Daten sehen, die zum jeweiligen Projekt zugeordnet werden.

source: Return Parameters : Return Parameters
de: Rückgabeparameter : Return Parameters

source: The clinical models that are used in a data retrieval. These models are usually defined in an {term}`openEHR` template.
de: Die Klinischen Modelle die in der Datenabfrage verwendet werden sollen. Diese Modelle werden in der Regel über ein {term}`openEHR<openEHR>` Template beschrieben.
